Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རྒྱ་མཚོའི་ཆུ་ལས་འཕགས་པ་ཡི། །རི་བོ་རི་རབ་ཅི་འདྲ་བ། །དེ་བཞིན་འཇིག་རྟེན་སྒྲོན་ན་ཡང་། ཆོས་ཀྱི་མཚོ་ལས་མངོན་པར་འཕགས། །
en: {32} “Just as Mount Meru Is higher than the ocean’s water, In that way, the Lamp of the World Is higher than the ocean of phenomena.

source: རིན་ཆེན་ཀུན་གྱི་འབྱུང་གནས་ཀྱིས། །རྒྱ་མཚོ་རྒྱས་པ་ཇི་བཞིན་དུ། །རང་བྱུང་ཡེ་ཤེས་དེ་བཞིན་ཏེ། མི་ཟད་སྐད་ཅིག་རབ་མཁྱེན་པ། །
en: {33} “Just as the vast ocean Is the source of all jewels, The Self-Arisen One’s wisdom Is unending instantaneous knowledge.

source: མགོན་པོའི་ཡེ་ཤེས་ཤིན་ཏུ་ཟབ། །ཚད་མེད་དེ་བཞིན་བགྲང་དུ་མྱེད། དེ་བས་སངས་རྒྱས་རྣམ་འཕྲུལ་པ། །བསམ་གྱིས་མྱི་ཁྱབ་ཚད་མེད་སྟོན། །སྒྱུ་མའི་མཚན་ཉིད་སྟོན་པ་ཡི། །
en: {34} “The Guide’s wisdom is profound, Incalculable, and immeasurable; Therefore, the Buddha demonstrates Immeasurable, inconceivable miracles.

source: སྒྱུ་མཁན་མཁས་པ་ཇི་ལྟ་བ། །དེ་ལྟར་སངས་རྒྱས་མཁྱེན་དབང་ཡང་། །རྣམ་པར་འཕྲུལ་པ་རབ་ཏུ་སྟོན། །
en: {35} “Just as a skilled magician Manifests the qualities of illusions, In that way, the Buddha, who has the power Of knowledge, manifests miracles.

source: ཡིད་བཞིན་ནོར་བུ་རྣམ་དག་པ། །བསམ་དོན་རྫོགས་བྱེད་ཇི་ལྟ་བ། །དེ་བཞིན་བསམ་པ་དག་པ་ལ། །རྒྱལ་བ་སྨོན་ལམ་རྫོགས་པ་མཛད། །
en: {36} “Just as a pure wish-fulfilling jewel Fulfills the wishes that are made, In that way, the Jina fulfills The pure aspirations of beings.

source: འོད་སྣང་གསལ་བ་བྱེད་པ་ཡི། །རིན་ཆེན་རྣམ་སྣང་ཇི་ལྟ་བ། །དེ་ལྟར་ཐམས་ཅད་མཁྱེན་པ་དག །འགྲོ་བའི་བསམ་པ་གསལ་བར་མཛད། །
en: {37} “Just as a shining jewel Shines with lights, In that way, pure omniscience Illuminates the aspirations of beings.

source: ཇི་ལྟར་ཕྱོགས་ལ་མངོན་ལྟ་བའི། །རིན་ཆེན་ཟུར་བརྒྱད་རབ་གནས་པ། དེ་བཞིན་ཆགས་མེད་སྒྲོན་མ་ཡང་། །ཆོས་དབྱིངས་རབ་ཏུ་སྣང་བ་མཛད་དུ། །
en: {38} “Just as a jewel with eight facets Remains facing all directions, In that way, the unimpeded Lamp Illuminates the realm of phenomena.

source: ཆུ་འདང་རིན་ཆེན་འོད་གསལ་བ། །ཇི་ལྟར་དྲི་མེད་ཆུ་འདང་བྱེད། །དེ་བཞིན་སངས་རྒྱས་མཐོང་བས་ཀྱང་། །འགྲོ་བའི་དབང་པོ་དག་པར་འགྱུར། །
en: {39} “Just as the bright water-purifying jewel Makes turbid water clear, In that way, the sight of the Buddha Purifies the senses of the world.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་སུ་སྨོན་ལམ་རབ་ཏུ་འཕྲུལ་བའི་ཟླ་བའི་རྒྱལ་པོས། །སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཕྱོགས་འདི་ཨིན་དྲ་ནཱི་ལ་ཡི། །ཁ་དོག་མདོག་གཅིག་བྱས་པ་ལྟར།
en: {40} Then the bodhisattva Dharma­dhātu­praṇidhi­sunirmita­candra­rāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “Just as looking through a sapphire transforms A direction in this world into the color of the sapphire, In the same way, seeing the Buddha Transforms beings into the color of enlightenment.

source: སངས་རྒྱས་མཐོང་བས་སྐྱེ་དགུ་རྣམས། །དེ་བཞིན་བྱང་ཆུབ་མདོག་ཏུ་འགྱུར། །སངས་རྒྱས་རྡུལ་ཕྲན་རེ་རེ་ལ། །རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་རྣམས། །ཚད་ཀྱིས་གཞལ་དུ་མེད་པ་སྟོན། །
en: {41} “The Buddha manifests immeasurable Miracles of various kinds, Within each single atom, That purify the bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་རྣམ་དག་མཛད། །དེ་ནི་རྨད་བྱུང་ཤིན་ཏུ་ཟབ། །མཐའ་ཡས་བསྒྲུབ་པར་དཀའ་བ་སྟེ། །བློ་ལྡན་ཡེ་ཤེས་ཡུལ་དེ་ལ། །འཇིག་རྟེན་རྣམས་ནི་འབབ་མི་ནུས། །
en: {42} “They are marvelous, profound, Infinite, difficult to accomplish, In the scope of the wisdom of the wise, And inaccessible to the world.

source: བྱང་ཆུབ་སེམས་དཔའ་བསྒྲུབ་དོན་དུ། །བཀོད་པ་ཕུན་སུམ་ཚོགས་པ་དང་། །སངས་རྒྱས་ཚུལ་གྱིས་རྣམ་སྦྱངས་པའི། །ཆོས་ཀྱི་དབྱིངས་ལ་འཇུག་པ་སྟོན། །
en: {43} “For the consummation of the bodhisattvas There is the perfected display, The purification of the Buddha’s activity That teaches entering the realm of the Dharma.

source: སངས་རྒྱས་ཞིང་རྣམས་བསམ་ཡས་པ། །བློ་ལྡན་བསྐོར་བའི་སངས་རྒྱས་ཀྱིས། །
en: {44} “The Jina manifests In countless buddha realms That are completely filled By buddhas encircled by the wise.

source: ཀུན་ནས་གང་བར་གྱུར་པ་ཡང་། །རྒྱལ་བ་དེ་ལ་སྟོན་པ་མཛད། །ཆོས་ཀུན་མངའ་སྒྱུར་སྟོན་པ་སྟེ། །ཤཱཀྱའི་ཁྱུ་མཆོག་སྐྱེས་པར་གྱུར། །
en: {45} “The Teacher with dominion over all Dharma teachings, The supreme one of the Śākyas, has appeared.

source: དེ་ཡི་ཆོ་འཕྲུལ་ཚད་མེད་པ། འདི་དག་རབ་ཏུ་བྱུང་བ་ཡིན། །
en: These miracles of his, which are Beyond measure, have occurred.

source: བརྟན་པའི་སྤྱོད་པ་སྣ་ཚོགས་རྣམས། །ཚད་མེད་རྣམ་པར་གཟིགས་གྱུར་ནས། །
en: {46} “You see this immeasurable variety Of the activities of the constant one.

source: རྣམ་པར་འཕྲུལ་པ་མཐའ་ཡས་པ། །ཚད་མེད་གཟི་ཅན་སྟོན་པ་མཛད། །
en: He who has immeasurable splendor Manifests infinite miracles.

source: འཇིག་རྟེན་མགོན་པོ་རྒྱལ་སྲས་རྣམས། །ཆོས་ཀྱི་དབྱིངས་ལ་སློབ་པ་མཛད། །ཆོས་རྣམས་ཐམས་ཅད་ཡོངས་ལ་ཡང་། །ཆགས་མེད་ཡེ་ཤེས་སྤྱོད་ཡུལ་འགྱུར། །
en: {47} “The Lord of the World teaches The Jina’s children in the essence of the Dharma, And they become those who have The unimpeded range of wisdom in all Dharmas.

source: སྐྱེས་བུ་དབང་པོའི་བྱིན་རླབས་ཀྱིས། །ཆོ་འཕྲུལ་བརྒྱ་དང་རབ་ལྡན་ཞིང་། །འཇིག་རྟེན་ཐམས་ཅད་རྣམ་སྤྱོད་པའི། །ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་བསྐོར། །
en: {48} “The lord of humans through his powers Turns the wheel of the Dharma, Manifesting hundreds of miracles And purifying the entire world.

source: སེམས་ཅན་གཙོ་བོའི་ཡུལ་ལ་ཡང་། །ཡེ་ཤེས་དཀྱིལ་འཁོར་ཡོངས་སྦྱོངས་ཤིང་། །ཤེས་རབ་ཆེན་པོའི་ཀླུ་ཆེན་རྣམས། །འཇིག་རྟེན་ཐམས་ཅད་འགྲེལ་བར་འགྱུར། །
en: {49} “In the domain of the supreme among beings There is the purified circle of knowledge, The great nāgas with enormous wisdom, Who bring liberation from the entire world.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དོན་གྱི་བློ་གྲོས་གཟི་བརྗིད་རྒྱལ་པོས། །བཅོམ་ལྡན་འདས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །དྲང་སྲོང་དམ་པའི་མཆོག་རྣམས་ཀྱི། །དུས་གསུམ་ཉན་ཐོས་གང་བྱུང་བ། །
en: {50} Then the bodhisattva Dharmārciṣmattejorāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “The śrāvakas of the supreme ṛṣi Who appear in the three times Are without the knowledge Of the footsteps the Sugata takes.

source: དེ་དག་ཀུན་གྱིས་བདེ་གཤེགས་ཀྱི། །གཤེགས་ཐབས་འཇོག་འདེག་མི་ཤེས་སོ། །དུས་གསུམ་མ་ལུས་ཐམས་ཅད་ཀྱི། །མ་ནོར་རང་རྒྱལ་གང་བྱུང་བ། །དེ་དག་གིས་ཀྱང་མགོན་པོ་ཡི། །
en: {51} “The entirety of the pratyeka­buddhas Free of error, who appear in the three times, Are also without the knowledge Of the footsteps the Protector takes.

source: གཤེགས་ཐབས་འཇོག་འདེག་མི་རིག་གོ །མ་རིག་མུན་པས་བསྒྲིབས་པ་རྣམས། །ཁྱི་ལྟར་ལྟོང་ལ་རྒྱུས་པ་ཡི། །སེམས་ཅན་དེ་འདྲ་ཀུན་གྱིས་ནི། །མགོན་པོ་མྱི་ཤེས་སྨོས་མི་དགོས། །
en: {52} “It goes without saying that all beings, Obscured by the darkness of ignorance And like dogs tied to a leash, Have no knowledge of the Guide.

source: རྒྱལ་བ་ཚད་མས་གཞལ་བ་མྱིན། །
en: {53} “The Jina cannot be known.

source: དེ་ནི་ཤེས་པར་མི་ནུས་ཏེ། །
en: He cannot be measured by any measure.

source: སངས་རྒྱས་ཆགས་མེད་ཡེ་ཤེས་ཅན། །
en: The Buddha has unimpeded knowledge.

source: ཚིག་གི་ལམ་ལས་ཤིན་ཏུ་འདས། །
en: He has transcended the path of words.

source: ཟླ་བ་ཉ་རྒྱས་འོད་མངའ་བ། བརྟན་པ་མཚན་གྱིས་རྣམ་པར་བྲིས། །
en: {54} “The constant one has the light of the full moon, And he is beautified by his features.

source: དེ་ནི་བསྐལ་པ་དཔག་ཡས་པར། །རྣམ་འཕྲུལ་ཐོགས་མེད་སྤྱོད་པ་མཛད། །ཚུལ་སྒོ་རེ་རེས་སངས་རྒྱས་ལ། །
en: For countless kalpas he performs Unimpeded miraculous actions.

source: ཤིན་ཏུ་མཉམ་བཞག་བསམ་བྱས་ཀྱང་། །བསྐལ་པ་བྱེ་བ་བསམ་ཡས་པ། །བརྗོད་དུ་མེད་པ་ཟད་འགྱུར་གྱི། །
en: {55} “Though one contemplates with a focused mind The Buddha in this and that way For countless millions of kalpas, He will remain indescribable.

source: རང་བྱུང་རྣམས་ཀྱི་ཡོན་ཏན་ལས། །ཕྱོགས་གཅིག་ཆ་ཡི་མཐར་མྱི་ཕྱིན། །
en: {56} “One will not completely understand A single aspect of the self-arisen qualities.

source: སངས་རྒྱས་དེ་ཡི་ཞལ་བལྟས་ཀྱང་། །སངས་རྒྱས་ཆོས་ནི་བསམ་མི་ཁྱབ། །
en: Even when the Buddha is gazed upon, The Buddha’s Dharmas are inconceivable.

source: གང་ཞིག་དེ་ལ་སྨོན་བྱེད་ཅིང་། །གང་ཞིག་ཡིད་ཀྱིས་དགའ་མོས་པ། །དེ་དག་ཀུན་གྱི་དེ་འདྲ་བའི། །སྤྱོད་ཡུལ་བལྟ་དཀའ་འཐོབ་པར་འགྱུར། །
en: {57} “All such fields of activity as those, Which are difficult to see, will appear To those who have the aspiration, To those whose minds delight in them.

source: བསོད་ནམས་ཡེ་ཤེས་མཐའ་ཡས་ཤིང་། །ཚོགས་ཅན་ཡངས་པས་རྣམ་གནོན་ལ། །དྲི་མེད་བློ་ལྡན་སེམས་གནས་པ། །དེ་དག་འདི་ཡི་ཚུལ་ལ་འཇུག །
en: {58} “Those who maintain an unstained, wise mind And have an overpowering, great accumulation Enter into this way Of infinite merit and wisdom.

source: དེ་དག་སྨོན་ལམ་རྒྱ་ཆེ་བས། །སེམས་དང་སྡོམ་པ་རྒྱ་ཆེ་སྟེ། །རྒྱལ་བའི་སྤྱོད་ཡུལ་ཐོབ་གྱུར་ཅིང་། །བྱང་ཆུབ་རྒྱ་ཆེན་གནོན་པར་འགྱུར། །
en: {59} “Those with vast aspirations, Vast motivation, and vows Will reach the field of activity of the jinas And attain vast enlightenment.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བདུད་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་འཐོར་བའི་ཡེ་ཤེས་རྒྱལ་མཚན་གྱི་རྒྱལ་པོས། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། །དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཆགས་མེད་ཡེ་ཤེས་སྐུ་མངའ་བས། །རང་བྱུང་རྣམས་ནི་སྐུ་མེད་དེ། །
en: {60} Then the bodhisattva Sarva­māra­maṇḍala­vikiraṇa­jñāna­dhvaja­rāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “They have bodies of unimpeded wisdom, And therefore the self-arisen ones have no body.

source: བསམ་ཡས་ཡེ་ཤེས་ཡུལ་མངའ་བས། །དེ་དག་བསམ་པར་མི་ནུས་སོ། །
en: The scope of their wisdom is inconceivable, And therefore one cannot conceive of them.

source: ཕྲིན་ལས་དཀར་པོ་བསམ་ཡས་པས། །སངས་རྒྱས་སྐུ་རབ་བསྒྲུབ་པའི་ཕྱིར། །དེ་ལ་འཇིག་རྟེན་གསུམ་མི་འགོ །མཚན་དང་དཔེ་བྱད་བཟང་པོས་མཛེས། །
en: {61} “A buddha’s body is obtained Through inconceivable acts of goodness, And therefore it is unstained by the three worlds And beautified by a supreme being’s features and signs.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱིས་རྣམ་སྦྱངས་པས། །འཇིག་རྟེན་ཀུན་ཏུ་སྣང་བ་མཛད། །
en: {62} “He completely illuminates the world And is purified of the realm of phenomena.

source: སངས་རྒྱས་བྱང་ཆུབ་སྒོ་ཡིན་ཏེ། །ཡེ་ཤེས་ཀུན་གྱི་གནས་ཆེན་ནོ། །ཆགས་པ་ཐམས་ཅད་རྣམ་སྤངས་པས། །རྡུལ་མེད་སྤྲོས་པ་མི་མངའོ། །
en: He is the gateway to the enlightenment of buddhahood And is the great source of all wisdom.

source: ཡེ་ཤེས་འོད་ཟེར་རབ་འགྱེད་པས། འཇིག་རྟེན་ཀུན་ཏུ་ཉི་མ་འདྲ། །ཁམས་གསུམ་ཐམས་ཅད་རྣམ་སྦྱོང་པས། །སྲིད་པའི་འཇིགས་པ་རྣམ་པར་གཅོད། །བྱང་ཆུབ་སེམས་དཔའ་བསྒྲུབ་པ་མཛད། །
en: {63} “Unsullied and pristine, Free of all clinging, A sun for the world Radiating rays of wisdom, {64} “Eliminating the terrors of existence Through purification of the three realms, And bringing bodhisattvas to perfection, He is the source of the enlightenment of buddhahood.

source: བྱང་ཆུབ་འབྱུང་གནས་དེ་བཞིན་ནོ། །ཁ་དོག་མཐའ་ཡས་སྟོན་མཛད་ཀྱང་། །ཁ་དོག་ཀུན་ལ་གནས་པ་མེད། །
en: {65} “Although he manifests infinite colors, He is devoid of all colors.

source: སེམས་ཅན་ཀུན་གྱིས་བསམ་ཡས་པའི། །ཁ་དོག་ཚད་མེད་ཡོངས་སུ་སྟོན། །
en: He manifests the countless, endless Colors because of all beings.

source: སྐད་ཅིག་གཅིག་ལ་སངས་རྒྱས་ཀྱི། །བྱང་ཆུབ་བསམ་ཡས་སྦྱངས་པས་ན། །དེ་ཡི་ཡེ་ཤེས་མཐར་ཕྱིན་པར། །རྟག་པར་སུས་ཀྱང་མི་ནུས་སོ། །
en: {66} “There is no one who can fully Understand the Buddha’s wisdom, Which in each instant purifies The enlightenment of buddhahood.

source: ཡེ་ཤེས་བསྟན་པ་ཟད་མྱི་ཤེས། །རང་བཞིན་རྣམ་པར་འགྱུར་བ་མེད། །
en: {67} “The unceasing teaching of wisdom Is by its nature unchanging.

source: དེ་ལ་དུས་གསུམ་རྒྱལ་བ་ཀུན། །སྐད་ཅིག་གཅིག་གིས་རབ་ཏུ་བརྗོད། །
en: In a single instant it describes All the jinas of the three times.

source: རྟག་པར་ལས་གཞན་ཡོངས་བཏང་སྟེ། །ཤེས་ལྡན་བྱང་ཆུབ་དོན་གཉེར་བས། །སེམས་ལ་སེམས་ཤེས་བྱ་བ་ཡང་། དེ་ལ་སེམས་སྐྱེ་མེད་པར་བསམ། །
en: {68} “The wise one who is dedicated to enlightenment, Constantly forsaking all other activity, Although his mind is called mind, In his mind no mind arises.

source: གང་གི་སངས་རྒྱས་བསྐྱེད་པ་ཡི། །སངས་རྒྱས་ཆོས་རྣམས་བསམ་མི་ཁྱབ། །དེ་དག་བརྗོད་པའི་ཡུལ་མ་ཡིན། །ཤིན་ཏུ་ཟབ་པས་ཚིག་ལམ་སྤངས། །
en: {69} “The qualities of buddhahood That the buddhas manifest Are inconceivable, are a field beyond description, Are profound, and are beyond the scope of words.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་མཛད་ཀྱི་སྨོན་ལམ་དཔལ་གྱི་རྒྱལ་མཚན་གྱིས། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །དྲན་པ་རྨོངས་མེད་དག་པ་རྣམས། །
en: {70} Then the bodhisattva Vairocana­praṇidhāna­ketu­dhvaja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “Those who are pure and with unconfused recollection, Who possess the Dharma with complete certainty, Who have inconceivable understanding, Are an unending ocean of enlightenment.

source: ཆོས་འཛིན་ཤིན་ཏུ་ངེས་རྟོགས་ཤིང་། །བློ་གྲོས་བསམ་གྱིས་མི་ཁྱབ་ལ། །བྱང་ཆུབ་རྒྱ་མཚོ་མྱི་ཟད་པ། །དེ་དག་ཡིད་ནི་འདི་ལ་དེས། །
en: {71} “Their minds have certainty concerning this.

source: དེ་དག་སྤྱོད་པའི་སྤྱོད་ཡུལ་ཡིན། །
en: This is their realm of practice.

source: དེ་དག་ཤེས་པ་འདིར་མྱི་གཡོ། །
en: Their wisdom is unshakable.

source: དེ་དག་འདི་ལ་ཐེ་ཙོམ་འཆད། །
en: They have eliminated doubt.

source: དེ་དག་སྐྱོ་བར་མྱི་འགྱུར་ཏེ། །
en: {72} “They do not become disheartened.

source: དེ་དག་ཡིད་ཀྱང་ཞུམ་མི་འགྱུར། །
en: They do not become despondent.

source: སངས་རྒྱས་ཆོས་ལ་རབ་གཞོལ་བར། །
en: They maintain the aspiration Of devotion to the Buddha’s Dharma.

source: དེ་དག་སེམས་ཀྱང་རབ་ཏུ་འབྱུང་། དེ་དག་དད་པ་རྟིང་ཚུགས་ཤིང་། །ཡང་དག་འཕགས་པ་རབ་ཏུ་བསྐྱེད། །
en: {73} “They have the deepest faith, And they develop what is truly superior.

source: དམིགས་མེད་གནས་པ་མེད་པ་ཡི། །ཡེ་ཤེས་འདི་ལ་དེ་དག་དགའ། །
en: They delight in the wisdom That has no object and no fixation.

source: བསྐལ་པ་བྱེ་བར་བསྩགས་པ་ཡི། །ཡོངས་སུ་རྫོགས་པའི་དགེ་བའི་ཆོས། །
en: {74} “They are filled with virtuous qualities Created during millions of kalpas.

source: ཡེ་ཤེས་འདི་འདོད་མཚུངས་པ་མེད། །དེ་དག་ཐམས་ཅད་ཡོངས་སུ་སྔོ། །
en: All of that is completely given away By these unequaled seekers of wisdom.

source: འཁོར་བའི་ནང་ན་རྣམ་རྒྱུ་ཡང་། །འཁོར་བ་དག་ལ་གནས་པ་མྱིན། །
en: {75} “Although they are active within saṃsāra, They are not based within saṃsāra.

source: སངས་རྒྱས་ཆོས་རྣམས་རབ་རྟོགས་པས། །སངས་རྒྱས་ཡུལ་ལ་རབ་ཏུ་རྩེ། །
en: They have realized the Buddha’s Dharma And so delight in the Buddha’s field of activity.

source: སེམས་ཅན་ཁམས་ནི་ཇི་སྙེད་དུ། །འཇིག་རྟེན་ཕུན་སུམ་ཚོགས་རྒྱུ་བ། །དེ་དག་ཐམས་ཅད་བརྟན་པས་སྤངས། །སངས་རྒྱས་ཕུན་སུམ་ཚོགས་ལ་གནས། །སངས་རྒྱས་རྟག་ཏུ་འབྱུང་འགྱུར་ཀྱང་།
en: {76} “Whatever worldly good fortune there is That occurs within the realms of beings, The resolute ones renounce it all, And they remain in the Buddha’s good fortune.

source: འཇིག་རྟེན་དོན་མེད་རབ་ཏུ་གནས། །
en: {77} “The world remains fruitless, Continuously in bondage.

source: ཆགས་མེད་སྤྱོད་པ་དེ་དག་ནི། །རྟག་ཏུ་སེམས་ཅན་དོན་ལ་གནས། །
en: Those whose conduct is free from attachment Are continuously fixed on benefiting beings.

source: དེ་དག་སྤྱོད་པ་མཚུངས་མེད་དེ། །ལུས་ཅན་ཀུན་གྱིས་བསམ་མི་ཁྱབ། །
en: {78} “Their unequaled conduct Is inconceivable for all beings.

source: འཇིག་རྟེན་བདེ་བ་ཀུན་སེམས་པས། །དེ་དག་སྡུག་བསྔལ་རྣམ་པར་བཟློག །
en: They who think of the world’s happiness Bring an end to suffering.

source: འཇིག་རྟེན་ཀུན་ལ་སྙིང་བརྩེ་ཞིང་། །བྱང་ཆུབ་ཡེ་ཤེས་རྣམ་དག་པས། །
en: {79} “They have compassion for the whole world And have the pure wisdom of enlightenment.

source: དེ་དག་འཇིག་རྟེན་སྣང་བར་གྱུར། །འཇིག་རྟེན་ཐམས་ཅད་རབ་ཏུ་འགྲེལ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་རྒྱལ་པོས། །
en: They are a light for the world And bring liberation to the entire world.”

source: སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་ཕྱོགས་བཅུར་རྣམ་པར་བལྟས་ཏེ། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །བསྐལ་པ་བྱེ་བ་ཕྲག་བརྒྱར་ཡང་། །སངས་རྒྱས་སྒྲ་ནི་རབ་དཀོན་ན། །ཐེ་ཙོམ་ཐམས་ཅད་གཅོད་པ་ཡི། །དམ་པ་མཐོང་བ་ཅི་ཞིག་སྨོས། །
en: {80} Then the bodhisattva Sarvāvaraṇa­vikiraṇa­jñāna­vikrānta­rāja, through the blessing of the Buddha, looked into the ten directions and recited these verses: “Even the word buddha is a great rarity For thousands of millions of kalpas, Let alone seeing a supreme one Who eliminates all doubts.

source: ཆོས་ཀུན་ཐུགས་སུ་ཆུད་རྟོགས་པ། །
en: {81} “He has gained the realization of all Dharmas.

source: འཇིག་རྟེན་གསུམ་པོའི་བསོད་ནམས་སྟེགས། །
en: He is the object of veneration for the three worlds.

source: སེམས་ཅན་ཐམས་ཅད་རྣམ་སྦྱོང་བའི། །
en: He brings purification to all beings.

source: འཇིག་རྟེན་སྒྲོན་མ་མཐོང་གིས་དགའ། །
en: He is a light for the world that brings joy when seen.

source: སེམས་ཅན་གཙོ་བོ་མ་སྨད་པའི། །གཟུགས་ཀྱི་སྐུ་ནི་མཐོང་གྱུར་ན། །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་ཏུ། །ངོམས་ཤིང་ཚིམ་པ་སྐྱེར་མི་བཏུབ། །
en: {82} “One will never have enough Of seeing the form body Of the supreme blameless being, Even in a quintillion kalpas.

source: མྱིའི་དབང་པོའི་སྐུ་གཟུགས་ལ། །རྒྱལ་བའི་སྲས་རྣམས་ལྟ་ལྟ་ཞིང་། །
en: {83} “The bodhisattvas are continually gazing At the form body of the lord of humans.

source: རང་གི་དགེ་བའི་ཆགས་མེད་པ། །གཞན་དོན་བརྩོན་པ་བྱང་ཆུབ་བསྔོ། །
en: They have no attachment, and they dedicate Their own virtues to enlightenment for the benefit of others.

source: ཐུབ་པ་ཆེན་པོའི་གཟུགས་ཀྱི་སྐུ། །དེ་ལས་སོ་སོ་ཡང་དག་རིག །ཆགས་མེད་ཡེ་ཤེས་འབྱུང་འགྱུར་བས། །དེ་ནི་སངས་རྒྱས་བྱང་ཆུབ་སྒོ། །
en: {84} “The form body of the great Muni Is this gateway to the enlightenment of buddhahood, From which comes unimpeded and Unceasing discriminating knowledge.

source: སེམས་ཅན་བསམ་ཡས་ཚད་མྱེད་པ། །སྣང་བར་མཛད་དེ་ཐེག་ཆེན་ལ། །བཙུད་ནས་ཐུབ་པ་ཆེན་པོའི་མཆོག །བྱང་ཆུབ་དམ་པར་ལུང་ཡང་སྟོན། །
en: {85} “The supreme great Muni illuminates Countless, innumerable beings, Brings them into the Mahāyāna, And prophesies their supreme enlightenment.

source: བསོད་ནམས་ཆེན་པོའི་རང་བཞིན་ཞིང་། །ཡེ་ཤེས་དཀྱིལ་འཁོར་ཤར་ཅིང་འབྱུང་། །འཇིག་རྟེན་ཚད་མེད་ཀུན་ཏུ་སྣང་། །བསོད་ནམས་ཕུང་པོ་རྣམ་འཕེལ་མཛད། །
en: {86} “He illuminates an infinite world, A realm that has the nature of great merit, A domain of wisdom that has arisen and appeared, And he multiplies accumulated merit.

source: སྡུག་བསྔལ་དྲ་བ་རབ་ཏུ་གཅོད། །ཡེ་ཤེས་ཕུང་པོ་རྣམ་པར་སྤྱོད། །
en: {87} “He cuts through the net of suffering And purifies the aggregation of wisdom.

source: གང་གིས་རྒྱལ་བ་བསྙེན་བཀུར་བ། །དེ་དག་ངན་སོང་འཇིགས་པ་མེད། །
en: Those who please the Jina Have no fear of the lower realms.

source: རྐང་གཉིས་དམ་པ་མཐོང་གྱུར་ན། །ཤིན་ཏུ་ཡངས་པའི་སེམས་སྐྱེ་སྟེ། །
en: {88} “On seeing the supreme two-legged being, An extremely vast motivation develops.

source: འདི་སྣང་གསལ་བའི་ཤེས་རབ་མཐུ། །གྲངས་མེད་པ་ཡང་སྐྱེ་བར་འགྱུར། །
en: The incalculable power of wisdom Creates an illuminating radiance.

source: སངས་རྒྱས་སྐྱེས་བུའི་མཆོག་མཐོང་ཞིང་། །བྱང་ཆུབ་དམ་པར་ངེས་པར་འགྱུར། །
en: {89} “Those who see the Buddha, the supreme human, Will certainly attain supreme enlightenment.

source: དེ་བཞིན་གཤེགས་པར་འགྱུར་བྱ་ཞེས། །དེ་དག་ཀུན་ཀྱང་ངེས་པར་སེམས། །
en: They will have certainty, thinking, ‘I shall become a tathāgata.’ ”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྨོན་ལམ་གྱི་གཞི་རབ་ཏུ་རྟོགས་པས། སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱིས་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་སོ། །ཡོན་ཏན་མཐའ་ཡས་ཕུན་ལྡན་པ། །ཤཱཀྱའི་ཁྱུ་མཆོག་ཐུབ་མཐོང་ནས། །ཡོངས་སུ་བསྔོ་བ་བྱེད་པའི་སེམས། །
en: {90} Then the bodhisattva Dharma­dhātu­praṇidhi­tala­nirbheda, through the blessing of the Buddha, looked into the ten directions and recited these verses: “Having seen the Muni who is the foremost Śākya, Who possesses a perfection of infinite qualities, Those with minds that make dedications Are purified within the Mahāyāna.

source: ཐེག་པ་ཆེ་ལ་རྣམ་པར་འདག །སེམས་ཅན་ཀུན་གྱི་དོན་གྱི་ཕྱིར། །ཐུགས་རྗེ་ཆེན་མངའ་བརྟན་པ་རྣམས། །ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་མཛད་པ། །དེ་བཞིན་གཤེགས་པ་འབྱུང་བར་འགྱུར། །
en: {91} “The constant ones who have great compassion, Who turn the wheel of the Dharma, The tathāgatas Appear for the sake of all beings.

source: བསྐལ་པ་ཁྲག་ཁྲིག་ཕྲག་བརྒྱར་ཡང་། །སེམས་ཅན་དོན་ལ་བརྩོན་མཛད་པའི། །སངས་རྒྱས་རྣམས་ལ་ལུས་ཅན་རྣམས། །ཀུན་གྱིས་ལན་གླན་ཅིས་ཀྱང་ནུས། །
en: {92} “How could all beings Be able to repay the buddhas, Who for trillions of kalpas Have been dedicated to benefiting beings?

source: ངན་སོང་གསུམ་པོ་མི་བཟད་པར། །བསྐལ་པ་བྱེ་བར་བཙོས་བླ་ཡི། །ཆགས་པ་ཐམས་ཅད་ཟློག་མཛད་པའི། །སྟོན་པ་མི་མཐོང་མ་ཡིན་ནོ། །
en: {93} “It is better to be cooked for ten million kalpas In the three unendurable lower existences Than to not see the Teacher, Who dispels all attachment.

source: སེམས་ཅན་ཀུན་གྱི་རྒྱུད་རྣམས་ན། །སྡུག་བསྔལ་ཕུང་པོ་ཇི་ཡོད་པ། །མ་ལུས་ཉམས་སུ་བཟོད་ནུས་ཀྱི། །སངས་རྒྱས་མི་མཐོང་མ་ཡིན་ནོ། །
en: {94} “However great the aggregation of suffering That exists within the minds of all beings, One can endure the experience of all of it, But not being deprived of seeing the Buddha.

source: འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་ན། །ཐ་དད་ངན་སོང་རྒྱུད་ཡོད་པ། །དེ་དག་ཡུན་རིང་གནས་བླ་ཡི། །སངས་རྒྱས་མི་མཐོང་མ་ཡིན་ནོ། །
en: {95} “It is better to remain for a long time In all these different states of being That are in the lower existences in this world Than to be deprived of hearing the Buddha.

source: སེམས་ཅན་དམྱལ་བ་རེ་རེར་ཡང་། །བསྐལ་པ་ཚད་མེད་གནས་བླ་ཡི། །མཐའ་ཡས་རྒྱལ་བས་བརྙེས་པ་ཡི། །བྱང་ཆུབ་མཆོག་ལས་རིང་གནས་མྱིན། །
en: {96} “It is better to remain for countless kalpas In each of the hell realms Than to remain far from the supreme enlightenment That has been attained by infinite jinas.

source: ཅི་ཞིག་ཕྱིར་ནི་ངན་སོང་དུ། །ཡུན་རིང་གནས་པར་འདོད་ཅེ་ན། །
en: {97} “For what reason would one wish to remain For a long time in the lower realms?

source: རྒྱལ་བའི་དབང་པོ་མཐོང་བ་ནི། །ཡེ་ཤེས་འཕེལ་བའི་རྒྱུར་འགྱུར་ཕྱིར། །
en: One would do so as a cause of seeing The lord of jinas, which increases wisdom.

source: རྒྱལ་བ་འཇིག་རྟེན་མཆོག་མཐོང་ན། །སྡུག་བསྔལ་ཐམས་ཅད་འཆད་པར་འགྱུར། །རྫོགས་པའི་སངས་རྒྱས་སྤྱོད་ཡུལ་གྱི། །ཡེ་ཤེས་ཁོང་དུ་ཆུད་པ་འབྱུང་། །
en: {98} “All suffering is eliminated Through seeing the Jina, the Lord of the World, And there is the realization of the wisdom Of the field of activity of the perfect buddhas.

source: སངས་རྒྱས་མྱི་ཡི་མཆོག་མཐོང་ཞིང་། །སྒྲིབ་པ་ཐམས་ཅད་ཟད་པར་འགྱུར། །
en: {99} “By seeing the Buddha, the supreme human, All obscurations are brought to an end.

source: བྱང་ཆུབ་གང་གིས་འཐོབ་པ་ཡི། །བསོད་ནམས་ཚད་མེད་འཕེལ་བར་འགྱུར། །
en: It causes the increase of immeasurable merit Through which enlightenment is attained.

source: སངས་རྒྱས་མཐོང་བ་སེམས་ཅན་རྣམས། །ཐེ་ཙོམ་ཡིད་གཉིས་ཆད་པར་འགྱུར། །འཇིག་རྟེན་འདས་དང་འཇིག་རྟེན་གྱི། །བསམ་པའང་ཡོངས་སུ་རྫོགས་པར་འགྱུར། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོས་བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་ཐམས་ཅད་ལ་རྣམ་པར་བལྟས་ཏེ། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་འདི་ཉིད་དེ་བས་ཀྱང་རྣམ་པར་དབྱེ་བ་དང་རྒྱ་ཆེར་བརྗོད་པ་དང་། གསལ་བར་བྱ་བ་དང་རབ་ཏུ་བརྗོད་པ་དང་། ཡང་དག་པར་བསྟན་པ་དང་། ཤིན་ཏུ་སྣང་བར་བྱ་བ་དང་། རབ་ཏུ་གསལ་བར་བྱ་བ་དང་མན་ངག་བསྟན་པའི་ཕྱིར། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ནམ་མཁའི་དབྱིངས་དང་མཉམ་པས། དུས་གསུམ་མཉམ་པ་ཉིད་དང་།
en: {100} “Seeing the Buddha eliminates The doubts and uncertainties of beings, And both worldly and unworldly Wishes are completely fulfilled.”

source: ཆོས་ཀྱི་དབྱིངས་མཉམ་པ་ཉིད་དང་སེམས་ཅན་གྱི་ཁམས་མཉམ་པ་ཉིད་དང་། འཇིག་རྟེན་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་ལས་ཀྱི་རྒྱུད་ཐམས་ཅད་མཉམ་པ་ཉིད་དང་སེམས་ཅན་གྱི་བསམ་པ་མཉམ་པ་ཉིད་དང་། སེམས་ཅན་གྱི་མོས་པ་མཉམ་པ་ཉིད་དང་། ཆོས་ཀྱི་སྣང་བ་མཉམ་པ་ཉིད་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་དུས་མཉམ་པ་ཉིད་དང་། འགྲོ་བ་ཐམས་ཅད་ཀྱི་དབང་པོ་མཉམ་པ་ཉིད་ཀྱིས། དེ་བཞིན་གཤེགས་པའི་ཏིང་ངེ་འཛིན་སེང་གེ་རྣམ་པར་བསྒྱིངས་པ།
en: {101} Samanta­bhadra Chapter 2 Then the bodhisattva mahāsattva Samanta­bhadra looked upon the great assembly of bodhisattvas, and in order to categorize, teach extensively, clarify, illuminate, and give instructions on the Tathāgata’s samādhi called the gaping lion, he taught those bodhisattvas in ten ways the Tathāgata’s samādhi called the gaping lion through the equality of the nature of the realm of phenomena with the element of space, the equality of the three times, the equality of the realm of phenomena, the equality of the realms of beings, the equality of all worlds, the equality of the continuum of karma, the equality of the thoughts of all beings, the equality of the aspirations of beings, the equality of the appearances of phenomena, the equality of the times for ripening beings, and the equality of the faculties of all beings.

source: འདི་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ལ་བསྟན་པའི་ཚུལ་བཅུས་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏེ། བཅུ་གང་ཞེ་ན།
en: What were those ten ways?
